---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewDescription
source: html/485448fd-6959-f93c-1ec4-2c79c5ac4b86.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewDescription Property

"Title on Sheet"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewDescription { get; }
```